InsideFra/Driverless-MMR-Elettronica-2019-2020/STM32 Files/Centralina 1/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define userButtorn_Pin GPIO_PIN_13
#define userButtorn_GPIO_Port GPIOC
#define IRQWireless_Pin GPIO_PIN_0
#define IRQWireless_GPIO_Port GPIOC
#define IRQWireless_EXTI_IRQn EXTI0_IRQn
#define Giroscopio_Pin GPIO_PIN_0
#define Giroscopio_GPIO_Port GPIOA
#define Accelerometro_Y_Pin GPIO_PIN_1
#define Accelerometro_Y_GPIO_Port GPIOA
#define Sensore_Ruota_Pin GPIO_PIN_2
#define Sensore_Ruota_GPIO_Port GPIOA
#define Accelerometro_X_Pin GPIO_PIN_3
#define Accelerometro_X_GPIO_Port GPIOA
#define userLED_Pin GPIO_PIN_13
#define userLED_GPIO_Port GPIOB
#define CSN_Pin GPIO_PIN_10
#define CSN_GPIO_Port GPIOA
#define CE_Pin GPIO_PIN_13
#define CE_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
